/*****************************************************************************************
* 文件名称：Main.c
* 说明：本文件为单片机与PC机通信系统的单片机程序
* 功能：单片机通过串口发送数据
* 修改：无
* 版本：1.0.0
* 作者：YuanDong
* 时间：2009.5.30
*****************************************************************************************/
#include " AT89X51.h "
#include "target.h"
void main()
{
 uchar buffer;
usart0_initial();
  while(1)
  {
delay_us(10);
	   buffer =get_char();	     //读取PC机发送数据
delay_us(10);
	   send_char(buffer);      //回复PC机接收到的数据
}
}

