
#include "task.h"

bit BIT_10MS;

extern void OS_ALLRun(void);
extern void start(void);

/*********************************************************************************************************
** º¯ÊýÃû³Æ: init
** ¹¦ÄÜÃèÊö: ³õÊ¼»¯³ÌÐò,´Ë´¦°üº¬¶¨Ê±Æ÷0¡¢´®ÐÐ¿Ú³õÊ¼»¯
** Êä¡¡¡¡Èë: ÎÞ
** Êä¡¡¡¡³ö: ÎÞ
** È«¾Ö±äÁ¿: ÎÞ
** µ÷ÓÃÄ£¿é: 
  **
** ×÷¡¡¡¡Õß: 
** ÈÕ¡¡¡¡ÆÚ: 
**-------------------------------------------------------------------------------------------------------
** ÐÞ ¸Ä ÈË:
** ÈÕ¡¡¡¡ÆÚ:
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
void init()
{
    
	//"ÏµÍ³³õÊ¼»¯"
	//IE = 0x00;      //"Çå³ýÖÐ¶Ï"
	EA = 1;			//×ÜÖÐ¶Ï
	//ES = 1;         //4"´®ÐÐÖÐ¶ÏÔÊÐí"
	//EX0 = 1;        //0"Íâ²¿ÖÐ¶Ï0ÔÊÐí"
	//ET0 = 1;        //1"¶¨Ê±Æ÷0ÖÐ¶ÏÔÊÐí"
	//EX1 = 1;        //2"Íâ²¿ÖÐ¶Ï1ÔÊÐí"
	//ET1 = 1;        //3"¶¨Ê±Æ÷1ÖÐ¶ÏÔÊÐí"
	//ET2 = 1;
	//IP = 0;         //"Çå³ýÖÐ¶ÏÓÅÏÈ¼¶"
	//PS = 1;         //"´®ÐÐÖÐ¶ÏÓÅÏÈ"
	//PX0 = 1;        //"Íâ²¿ÖÐ¶Ï0"
	//PT0 = 1;        //"¶¨Ê±Æ÷ÖÐ¶Ï0"
	//PX1 = 1;        //"Íâ²¿ÖÐ¶Ï1"
	//PT1 = 0;        //"¶¨Ê±Æ÷ÖÐ¶Ï1"
	//TCON--------     "¶¨Ê±Æ÷¿ØÖÆ¼Ä´æÆ÷",   TF1 | TR1 | TF0 | TR0 | IE1 | IT1 | IE0 | IT0
	//TCON = 0;
	//TF1             "T1Òç³ö±êÖ¾"
	//TR1 = 1;        //"T1ÔËÐÐ¿ØÖÆ"
	//TF0             "T0Òç³ö±êÖ¾"
	//TR0 = 1;        //"T0ÔËÐÐ¿ØÖÆ"
	//IE1             "Íâ²¿ÖÐ¶Ï1ÉêÇë±êÖ¾"
	//IT1 = 1;        //"Íâ²¿ÖÐ¶Ï1´¥·¢·½Ê½ 0=µçÆ½ 1=±ßÑØ"
	//IE0             "Íâ²¿ÖÐ¶Ï0ÉêÇë±êÖ¾"
	//IT0 = 1;        //"Íâ²¿ÖÐ¶Ï0´¥·¢·½Ê½ 0=µçÆ½ 1=±ßÑØ"
	//TMOD--------    "¶¨Ê±Æ÷Ä£Ê½¿ØÖÆ¼Ä´æÆ÷"
	//  | GATE   | C//T   | M0     | M1    | GATE   | C//T   | M0       | M1        |
	//"¸ß4Î»ÓÃÓÚT1  µÍ4Î»ÓÃÓÚT0"
	//TMOD = 0x21;
	//SCON  "´®ÐÐ¿ØÖÆ"
	//| SM0 | SM1 | SM2 | REN | TB8 | RB8 | TI  | RI  |
	//"| SM0  SM1 | ¹¤×÷·½Ê½  |   Ëµ    Ã÷   |   ²¨ ÌØ ÂÊ    |"
	//"|   0    0 | ·½ Ê½ 0   |´  Í¬²½ÒÆÎ»   |   fosc/12     |"
	//"|   0    1 | ·½ Ê½ 1   | 10Î»Òì²½ÊÕ·¢ |  ¶¨Ê±Æ÷¿ØÖÆ   |"
	//"|   1    0 | ·½ Ê½ 2   | 11Î»Òì²½ÊÕ·¢ |fosc/32|fosc/64|"
	//"|   1    1 | ·½ Ê½ 3   | 11Î»Òì²½ÊÕ·¢ |  ¶¨Ê±Æ÷¿ØÖÆ   |"
	//"SM2 ¶à»úÍ¨Ñ¶ÔÊÐí"
	//"REN ½ÓÊÕÔÊÐí¿ØÖÆ"
	//"TB8 ·¢ËÍÊý¾ÝµÚ9Î»"
	//"RB8 ½ÓÊÕÊý¾ÝµÚ9Î»"
	//"TI  ·¢ËÍÖÐ¶Ï±êÖ¾"
	//"RI  ½ÓÊÜÖÐ¶Ï±êÖ¾"
	//SCON = 0x50;
	//PCON "µçÔ´¿ØÖÆ¼Ä´æÆ÷"
	//SMOD"²¨ÌØÂÊÑ¡ÔñÎ» =1 ·½Ê½1,2,3 ²¨ÌØÂÊ¼Ó±¶"
	//"²¨ÌØÂÊ=2^(sod)*fosc/(32*12*(256-³õÖµ))"
    //T2CON = 0x0;
    //TR2 = 1;
    //ET2 = 1;
//-----------ÖÐ”à³õÊ¼»¯-------------------------------------------------  BELL
//INT0 init		  
#ifdef EN_OS_INT0
    IT0 = 1;    //Íâ²¿ÖÐ¶ÏÎª±ßÑØ´¥·¢
    EX0 = 1;    //ÔÊÐíÍâ²¿ÖÐ¶Ï
	
#endif

 

  #ifdef EN_OS_INT1
//	PX1 = 1;    //"Íâ²¿ÖÐ¶Ï1"
    IT1 = 1;    //Íâ²¿ÖÐ¶ÏÎª±ßÑØ´¥·¢
    EX1 = 1;    //ÔÊÐíÍâ²¿ÖÐ¶Ï 
  #endif  	
  
    
#ifdef EN_OS_SERIAL
    SCON = 0x50;
    //TMOD|= 0x20;
	BRT	   = 0xfb;  //0xfb: 18.432MHz,12T,SMOD=0,9600bps
	AUXR   |= 0x11;	// Ê¹ÓÃ¶ÀÁ¢²¨ÌØÂÊ·¢ÉúÆ÷
   /* TH1  = 0xFB;
    TL1  = 0xFB;
    TR1  = 1; */
  //  ES   = 1;       //ÔÊÔS´®¿ÚÖÐ”à
   // PS = 1;         //"´®ÐÐÖÐ¶ÏÓÅÏÈ"
   // PSH;
#endif

#ifdef EN_OS_TIMER0
/****************¶¨Ê±Æ÷0³õÊ¼»¯****************/
  TMOD|=0X01;
  	ET0=1; 
 	TH0 = 0x0FD; //400us
    TL0 = 0x9A;
	IPH=0X09; 	 
#endif
/****************¶¨Ê±Æ÷1³õÊ¼»¯****************/
#ifdef EN_OS_TIMER1
     TMOD|=0X20;//8Î»×Ô¶¯ÖØÔØÄ£Ê½ 
  	 ET1=1;  //¶¨Ê±Æ÷0¿ªÖÐ¶Ï
     TH1=0x00;//¶¨Ê±160us ¾§Õñ18.432M
     TL1=0x00;
#endif
/***************************/
#ifdef EN_OS_UART2	 

	S2CON  = 0x50;  //0101,0000 8Î»¿É±ä²¨ÌØÂÊ£¬ÎÞÆæÅ¼Ð£ÑéÎ»,ÔÊÐí½ÓÊÕ
	BRT	   = 0xfb;  //0xfb: 18.432MHz,12T,SMOD=0,9600bps
	AUXR   |= 0x11;  //T0x12,T1x12,UART_M0x6,BRTR,S2SMOD,BRTx12,EXTRAM,S1BRS	
	IE2	    = 0x01;	//ÔÊÐí´®¿Ú2ÖÐ¶Ï,ES2=1
#endif

/***/
#ifdef EN_OS_PCA0  //ÓÃÓÚ16Î»¶¨Ê±

    CMOD = 0x80;   	 //12·ÖÆµ
    CCON = 0x00;   //ÇåÖÐ¶Ï±êÖ¾
    CL = 0;
    CH = 0;
	CCAP0H = 0xEF; //40ms¶¨Ê±
    CCAP0L = 0xD8;  
	CCAPM0 = 0x49; //ÉèÖÃPCA0Îª16Î»¶¨Ê±Æ÷£¬ÔÊÐíPCAÄ£¿é0ÖÐ¶Ï
	//CR=1; //Æô¶¯PCA¼ÆÊý
#endif
/*******************************************/
#ifdef EN_OS_PCA1	  //ÓÃÓÚ16Î»¶¨Ê±

    CMOD = 0x80;   	 //12·ÖÆµ
	CCON = 0x00;   //ÇåÖÐ¶Ï±êÖ¾    
    CL = 0;
    CH = 0;  
    CCAP1H =0x01;
    CCAP1L =0x68;	//us¶¨Ê±
	//CCAPM1 = 0x49;  ÔÊÐíPCAÄ£¿é1ÖÐ¶Ï 

#endif
/***********************************************************************/
}
/*********************************************************************************************************
** º¯ÊýÃû³Æ: main
** ¹¦ÄÜÃèÊö: Ö÷º¯Êý£¬ÓÃ»§³ÌÐò´ÓÕâÀïÖ´ÐÐ
** Êä¡¡¡¡Èë: ÎÞ
** Êä¡¡¡¡³ö: ÎÞ
** È«¾Ö±äÁ¿: ÎÞ
** µ÷ÓÃÄ£¿é: init()
**
** ×÷¡¡¡¡Õß:
** ÈÕ¡¡¡¡ÆÚ: 
**-------------------------------------------------------------------------------------------------------
** ÐÞ ¸Ä ÈË:
** ÈÕ¡¡¡¡ÆÚ:
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/

void main(void)
{
    init();
	start();
				    
	while(1)
	{
       OS_ALLRun();
    }
 }
 /*********************************************************************************/
/*************************************************************************************
************************************************************************************
***********************                                     ***************************
***********************    http://59tiaoba.taobao.com       ***************************
***********************                                     ***************************
********************************³ÌÐò±àÐ´£ºFucp****************************************
**********************************************************************************/