/*******************************************************************************
* 文件名称：main.c                          
* 说明：本文件为小车控制的主函数
* 功能：1.看门狗定时器初始化 
        2.调用函数，进行小车直流电机的开环控制
* 修改： 无
* 版本：1.0.0
* 作者：YuanDong 
* 时间：2009.7.14 
*******************************************************************************/
#include  <AT89X52.h>
#include  <kongzhi.h>

/********************************************************
*函数名称：void main()
*函数功能：调用函数
*函数入口：无
*函数出口：无
********************************************************/
void main()
{
	  WDT_CONTR=0x3b;
	  timer_init();		//初始化
	  while(1)
	{
	  keyboard();		//键盘扫描
	 // jieshou();		//遥控信号检测,要与传感器实物连接才能正常使用.
	  xunji();			//循迹检测
	  bizhang();		//避碍物检测
	  stop();			//目标站点检测
	  WDT_CONTR=0x3b;  	//喂狗
	}
}