/******************************************************************************
* 文件名称：lcd_main.c							   
* 功    能：在LCD上显示相应的字符串
* 当前版本：1.0
* 作    者：YuanDong
* 完成日期：2009年6月18日
******************************************************************************/	
/******************************************************************************
* 文件名称：lcd_main.c							   
* 功    能：在LCD上显示相应的字符串
* 当前版本：1.1
* 作    者：YuanDong
* 完成日期：2009年6月21日
******************************************************************************/
#include "LM041L.h"
void main()
{
   EN=0;
   initlcd();
   while(1)
    {
      clrscr();
      wrstrdat(0,1,"abcdefghijklmopqrstuvwxyz",26);
	      //屏幕共4行（0，1，2，3），每行16列（0...15）
      delay(3000);
      clrscr();
      wrstrdat(1,14,"1234567890",10);
      delay(3000);
      clrscr();
      wrstrdat(1,14,"ABCDEFGHIJKLMNOPRSTUVWXYZ1234567890",36);
      delay(3000);   
    }
}