#define TARGET_GLOBAL 1
#include "target.h"
/****************************************
*函数名称：target_init(void)
*函数功能：包含本文件中初始化函数和变量
*函数入口：无
*函数出口：无
****************************************/
void target_init(void)
{
  timer0_init();  //timer0初始化
  int0_init();	  //外部中断0初始化
  int1_init();	  //外部中断1初始化
}
/****************************************
*函数名称：timer0_init(void)
*函数功能: 定时器0初始化，11.0592Mhz晶振，
  定时10ms
*函数入口：无
*函数出口：无
*****************************************/
void timer0_init(void)  
{
  TMOD|=0x01;    //MODEL1,timer
  TH0=0xDC;	     //定时10ms
  TL0=0x00;
  ET0=1;	     //中断使能
  TR0=0;		 //关闭定时器0
}
/****************************************
*函数名称：int0_init(void)
*函数功能: 外部中断0中断初始化
*函数入口：无
*函数出口：无
*****************************************/
void int0_init(void)
{
  EX0 = 1;	 //外部中断0使能
  T0 = 1;	 //外部中断0跳变中断(下降沿跳变)
}
/****************************************
*函数名称：int1_init(void)
*函数功能: 外部中断0中断初始化
*函数入口：无
*函数出口：无
*****************************************/
void int1_init(void)
{
  EX1 = 1;	 //外部中断1使能
  IT1 = 1;	 //外部中断1跳变中断(下降沿跳变) 
}
/*******************************************
*函数名称：ms_to_s(uchar *clockS)
*函数功能：实现毫秒级向秒级进位
*函数入口：*clockS,指向时间数组的指针
*函数出口：无
说明：说明：毫秒级和秒级计数均为两位BCD码，
毫秒最大值为99，秒最大值为59
*******************************************/
void ms_to_s(uchar *clockS)     
{
  if(clockS[S_L]<'9')
    clockS[S_L]++;
  else
  {
    clockS[S_L]='0';
    if(clockS[S_H]<'5')
	 clockS[S_H]++;
	else
	{
	  clockS[S_H]='0';
	  s_to_min(clockS);
	} 
  }
}
/*******************************************
*函数名称：s_to_min(uchar *clockMin)
*函数功能：实现秒级向分钟级进位
*函数入口：*clockMin,指向时间数组的指针
*函数出口：无
*说明：秒级和分钟级计数均为两位BCD码，
      秒最大值59，分最大值99
*******************************************/
void s_to_min(uchar *clockMin)
{
  if(clockMin[MIN_L]<'9')
    clockMin[MIN_L]++;
  else
  {
    clockMin[MIN_L]='0';
    if(clockMin[MIN_H]<'9')
	 clockMin[MIN_H]++;
	else
	{
	  clockMin[MIN_H]='0';
	} 
  }
}