/********************************************
*实例名称：数控电压源
*实例功能：利用单片机来实现电压源的数字
控制。
*芯片资源：外部中断0，1；端口P0
*作者：lhw
*时间：09.06.12
********************************************/
#include "target.h"
uchar temp;
/********************************************
*函数名称：int0()
*函数功能：外部中断0中断入口，用于增加功能
********************************************/
void int0() interrupt 0
{
  temp++;				
  if(temp == 0x00) 		 
    temp = 0XFF;
}
/********************************************
*函数名称：int1()
*函数功能：外部中断0中断入口，用于减少功能
********************************************/
void int1() interrupt 2
{
  temp--;
  if(temp == 0xff)		
    temp = 0x00;
}
void main()
{
  key_init();   //外部中断初始化
  temp=0x00;
  sei();       //开总中断
  while(1)
  {
   ADIN = temp;	  //等待中断，实时保持输出 
  }
}