/*******************************************************
* 文件名称：delay.c                          
* 说明：本文件为各种延时小程序集合，系统时钟：8M
* 功能：提供各种延时小函数
* 修改： 无
* 版本：1.0.0
* 作者：YuanDong 
* 时间：2009.7.20
*********************************************************/

/********************************************************
*函数名称：void delay_1us(void)
*函数功能：延时1us函数
*函数入口：无
*函数出口：无
********************************************************/
void delay_1us(void)                 //1us延时函数
  {
   asm("nop");
  }

/********************************************************
*函数名称：void delay_nus(void)
*函数功能：延时1us函数
*函数入口：n
*函数出口：无	  
********************************************************/
void delay_nus(unsigned int n)       //N us延时函数
  {
   unsigned int i=0;
   for (i=0;i<n;i++)
   delay_1us();
  }
 
/********************************************************
*函数名称：void delay_1ms(void)
*函数功能：延时1ms函数
*函数入口：无
*函数出口：无
********************************************************/ 
void delay_1ms(void)                 //1ms延时函数
  {
   unsigned int i;
   for (i=0;i<1140;i++);
  }

/********************************************************
*函数名称：void delay_nms(void)
*函数功能：延时1ms函数
*函数入口：n
*函数出口：无	  
********************************************************/  
void delay_nms(unsigned int n)       //N ms延时函数
  {
   unsigned int i=0;
   for (i=0;i<n;i++)
   delay_1ms();
  }
